Sethu-raj/STM32_F407/30_UART_Interrupt_BareMetal/Src/01_spi_tx_testings.c
/*
 * 01_spi_tx_testings.c
 *
 *  Created on: May 19, 2026
 *      Author: sethu
 */


/*
SPI2 LOOPBACK CONNECTION:
PB15 (MOSI) ---- PB14 (MISO)
*/
/*
* AF5 -- SPI2
* PB14 -- MISO
* PB15 -- MOSI
* PB13 -- SCLK
* PB12 --- NSS
*/
#include "stm32f407xx.h"
#include "stm32f407xx_gpio_driver.h"
#include "stm32f407xx_spi_driver.h"
#include <string.h>


void delay(void)
{
	for(uint32_t i = 0;i < 500000;i++);
}


// It will send hello sethu over mosi lin e

void SPI2_GPIOInits(void)
{
	GPIO_Handle_t SPIPins,NSSpin;

	SPIPins.pGPIOx = GPIOB;
	SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	SPIPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5;
	SPIPins.GPIO_PinConfig.GPIO_PinOPtype = GPIO_OP_TYPE_PP;
	SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	// SCLK
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&SPIPins);

	// MOSI
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	GPIO_Init(&SPIPins);

	// MISO   - we can disable this pin not using
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	GPIO_Init(&SPIPins);

	// NSS  - we can disable this pin not using
	NSSpin.pGPIOx = GPIOB;
	NSSpin.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	NSSpin.GPIO_PinConfig.GPIO_PinOPtype = GPIO_OP_TYPE_PP;
	NSSpin.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	NSSpin.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	NSSpin.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIO_Init(&NSSpin);
	GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_12, SET);

}

void SPI2_Init(void)
{
	SPI_Handle_t SPI2handle;

	SPI2handle.pSPIx = SPI2;
	SPI2handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
	SPI2handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
	SPI2handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV32;
	SPI2handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
	SPI2handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
	SPI2handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
	SPI2handle.SPIConfig.SPI_SSM = SPI_SSM_EN; //software slave management

	SPI_Init(&SPI2handle);
}
char user_data[] = "Hello Sethu";
char read_buffer[32]; // Buffer to store received data


int main(void)
{

	//char user_data[]="Hello Sethu";

	//this function is used to initalize gpio pins behave as SPI
	SPI2_GPIOInits();

	//this function is used to initailze spi2 peripheral parameters.
	SPI2_Init();

	//this makes NSS Signal internally high and avoids MODF error
	SPI_SSIConfig(SPI2, ENABLE);
    SPI_SSOEConfig(SPI2, DISABLE);
	//Enable SPI2 Peripheral
    SPI_PeripheralControl(SPI2, ENABLE);

    delay();

//	SPI_SendData(SPI2, (uint8_t*)user_data,strlen(user_data));
//    SPI_PeripheralControl(SPI2,DISABLE );
      GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_12, RESET); // select slave
      SPI_TransmitReceive(SPI2, (uint8_t*)user_data, (uint8_t*)read_buffer, strlen(user_data));
      GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_12, SET); // deselect slave
      read_buffer[strlen(user_data)] = '\0';

	while(1);

	return 0;
}
